khoih-prog/WiFiManager_NINA_Lite/src/WiFiManager_NINA_Lite_RP2040.h
        WN_LOGERROR3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
        
        if (readBuffer != nullptr)
        {
          // Free buffer
          delete [] readBuffer;
          WN_LOGDEBUG(F("Buffer freed"));
        }
        
        if ( checkSum == readCheckSum)
        {
          return true;
        }
      }
      
      return false;
    }
    
    //////////////////////////////////////////////

    bool loadDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      totalDataSize = sizeof(WIFININA_config) + sizeof(readCheckSum);
      
      FILE *file = fopen(CREDENTIALS_FILENAME, "r");
      
      WN_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        WN_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = fopen(CREDENTIALS_FILENAME_BACKUP, "r");
        
        WN_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          WN_LOGDEBUG(F("failed"));
          return false;
        }
      }
     
      uint16_t offset = 0;
      
      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        uint8_t * _pointer = (uint8_t *) myMenuItems[i].pdata;
        totalDataSize += myMenuItems[i].maxlen;

        // Actual size of pdata is [maxlen + 1]
        memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);
        
        // Redundant, but to be sure correct position
        fseek(file, offset, SEEK_SET);
        fread(_pointer, 1, myMenuItems[i].maxlen, file);
        
        offset += myMenuItems[i].maxlen;        
    
        WN_LOGDEBUG3(F("CrR:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);         
               
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;  
        }       
      }

      fread((uint8_t *) &readCheckSum, 1, sizeof(readCheckSum), file);
      
      WN_LOGDEBUG(F("OK"));
      
      fclose(file);
      
      WN_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));
      
      if ( checkSum != readCheckSum)
      {
        return false;
      }
      
      return true;    
    }
    
    //////////////////////////////////////////////

    void saveDynamicData()
    {
      int checkSum = 0;
    
      FILE *file = fopen(CREDENTIALS_FILENAME, "w");
      
      WN_LOGDEBUG(F("SaveCredFile "));

      uint16_t offset = 0;
      
      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;
       
        WN_LOGDEBUG3(F("CW1:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          // Redundant, but to be sure correct position
          fseek(file, offset, SEEK_SET);
          fwrite(_pointer, 1, myMenuItems[i].maxlen, file); 
          
          offset += myMenuItems[i].maxlen;      
        }
        else
        {
          WN_LOGDEBUG(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        fwrite((uint8_t *) &checkSum, 1, sizeof(checkSum), file);        
        fclose(file);
        
        WN_LOGDEBUG(F("OK"));    
      }
      else
      {
        WN_LOGDEBUG(F("failed"));
      }   
           
      WN_LOGDEBUG1(F("CrWCSum=0x"), String(checkSum, HEX));
      
      // Trying open redundant Auth file
      file = fopen(CREDENTIALS_FILENAME_BACKUP, "w");
      
      WN_LOGDEBUG(F("SaveBkUpCredFile "));

      offset = 0;
      
      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {       
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;
     
        WN_LOGDEBUG3(F("CW2:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);
        
        if (file)
        {
          fseek(file, offset, SEEK_SET);
          fwrite(_pointer, 1, myMenuItems[i].maxlen, file); 
          
          // Redundant, but to be sure correct position
          offset += myMenuItems[i].maxlen; 
        }
        else
        {
          WN_LOGDEBUG(F("failed"));
        }        
                     
        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++,_pointer++)
        {         
          checkSum += *_pointer;     
         }
      }
      
      if (file)
      {
        fwrite((uint8_t *) &checkSum, 1, sizeof(checkSum), file);        
        fclose(file);
        
        WN_LOGDEBUG(F("OK"));    
      }
      else
      {
        WN_LOGDEBUG(F("failed"));
      }   
    }
#endif

    //////////////////////////////////////////////

    bool loadConfigData()
    {
      WN_LOGDEBUG(F("LoadCfgFile "));
      
      // file existed
      FILE *file = fopen(CONFIG_FILENAME, "r");
      
      if (!file)
      {
        WN_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = fopen(CONFIG_FILENAME_BACKUP, "r");
        
        WN_LOGDEBUG(F("LoadBkUpCfgFile "));

        if (!file)
        {
          WN_LOGDEBUG(F("failed"));
          return false;
        }
      }
     
      fseek(file, 0, SEEK_SET);
      fread((uint8_t *) &WIFININA_config, 1, sizeof(WIFININA_config), file);
      fclose(file);

      WN_LOGDEBUG(F("OK"));
      
      return isWiFiConfigValid();
    }
    
    //////////////////////////////////////////////

    void saveConfigData()
    {
      WN_LOGDEBUG(F("SaveCfgFile "));

      int calChecksum = calcChecksum();
      WIFININA_config.checkSum = calChecksum;
      WN_LOGDEBUG1(F("WCSum=0x"), String(calChecksum, HEX));
      
      FILE *file = fopen(CONFIG_FILENAME, "w");

      if (file)
      {
        fseek(file, 0, SEEK_SET);
        fwrite((uint8_t *) &WIFININA_config, 1, sizeof(WIFININA_config), file);
        fclose(file);
        
        WN_LOGDEBUG(F("OK"));
      }
      else
      {
        WN_LOGDEBUG(F("failed"));
      }
      
      WN_LOGDEBUG(F("SaveBkUpCfgFile "));
      
